{
    "en": {
        "welcome": "Welcome! Please select your language:",
        "subscribe": "To use the bot, please subscribe to our channel:",
        "check": "✅ Check subscription",
        "subscribe_btn": "📢 Subscribe to channel",
        "access_granted": "🎉 Access granted! Loading menu...",
        "not_subscribed": "❌ You are not subscribed! Click 'Subscribe' and try again.",
        "check_error": "⚠️ Subscription check error. Please try later.",
        "menu": "Main Menu",
        "reg": "📝 Registration",
        "instr": "📚 Instructions",
        "support": "🛠 Support",
        "algo": "⚙️ Algorithm",
        "next": "➡️ Next",
        "back": "⬅️ Back",
        "registration_message": "👑 Hello! To activate the bot, complete a quick registration on the 1WIN website (<a href=\"PERSONAL_LINK\">CLICK</a>)\n\n⚠️ It’s important to create a NEW account using the link in this message! Use a phone number that hasn’t been used on this site before, and do not use social media accounts. If you already have a 1WIN account, please log out.\n\n1. Click the button: <a href=\"PERSONAL_LINK\">Register</a> in incognito mode, go to the 1WIN website and CREATE A NEW ACCOUNT. If the site doesn’t open, try using a VPN: Vpnify, Planet VPN, Hotspot VPN, etc.",
        "dep": "👑Before starting, you need to top up your account balance. I recommend topping up with at least 2,000 rubles."
    },
    "ru": {
        "welcome": "Добро пожаловать! Пожалуйста, выберите язык:",
        "subscribe": "Для использования бота необходимо подписаться на наш канал:",
        "check": "✅ Проверить подписку",
        "subscribe_btn": "📢 Подписаться на канал",
        "access_granted": "🎉 Доступ разрешен! Загружаем меню...",
        "not_subscribed": "❌ Вы не подписаны! Нажмите 'Подписаться' и попробуйте снова.",
        "check_error": "⚠️ Ошибка проверки подписки. Попробуйте позже.",
        "menu": "Главное меню",
        "reg": "📝 Регистрация",
        "instr": "📚 Инструкция",
        "support": "🛠 Поддержка",
        "algo": "⚙️ Алгоритм",
        "next": "➡️ Далее",
        "back": "⬅️ Назад",
        "registration_message": "👑 Привет! Для активации бота пройди быструю регистрацию на сайте 1WIN (<a href=\"PERSONAL_LINK\">КЛИК</a>)\n\n⚠️ Важно создать НОВЫЙ аккаунт по ссылке в этом сообщении! Используй номер телефона, который ранее не использовался на этом сайте, и не используй социальные сети. Если у тебя уже есть акаунт на 1WIN, выйди из него.\n\n1. Нажми на кнопку: <a href=\"PERSONAL_LINK\">Зарегистрироваться</a> в режиме инкогнито, перейди на сайт 1WIN и СОЗДАЙ НОВЫЙ АККАУНТ. Если сайт не открывается, попробуй использовать VPN: Vpnify, Planet VPN, Hotspot VPN и так далее!",
        "dep": "👑Перед стартом необходимо пополнить баланс своего аккаунта. Рекомендую пополнять от 2000 рублей."
    },
    "hi": {
        "welcome": "स्वागत है! कृपया अपनी भाषा चुनें:",
        "subscribe": "बॉट का उपयोग करने के लिए, कृपया हमारे चैनल को सब्सक्राइब करें:",
        "check": "✅ सदस्यता जांचें",
        "subscribe_btn": "📢 चैनल को सब्सक्राइब करें",
        "access_granted": "🎉 पहुंच प्रदान की गई! मेनू लोड हो रहा है...",
        "not_subscribed": "❌ आपने सब्सक्राइब नहीं किया है! 'सब्सक्राइब करें' पर क्लिक करें और फिर से प्रयास करें।",
        "check_error": "⚠️ सदस्यता जांच त्रुटि। कृपया बाद में प्रयास करें।",
        "menu": "मुख्य मेनू",
        "reg": "📝 पंजीकरण",
        "instr": "📚 निर्देश",
        "support": "🛠 समर्थन",
        "algo": "⚙️ एल्गोरिदम",
        "next": "➡️ अगला",
        "back": "⬅️ पीछे",
        "registration_message": "👑 नमस्ते! बॉट को सक्रिय करने के लिए 1WIN वेबसाइट पर त्वरित पंजीकरण करें (<a href=\"PERSONAL_LINK\">क्लिक करें</a>)\n\n⚠️ इस संदेश में दी गई लिंक का उपयोग करके नया खाता बनाना महत्वपूर्ण है! ऐसे फोन नंबर का उपयोग करें जो इस साइट पर पहले इस्तेमाल न हुआ हो, और सोशल मीडिया खातों का उपयोग न करें। यदि आपके पास पहले से 1WIN पर खाता है, तो कृपया लॉग आउट करें।\n\n1. बटन पर क्लिक करें: <a href=\"PERSONAL_LINK\">रजिस्टर करें</a> गुप्त मोड में, 1WIN वेबसाइट पर जाएं और नया खाता बनाएं। यदि साइट नहीं खुलती, तो VPN का उपयोग करें: Vpnify, Planet VPN, Hotspot VPN, आदि।",
        "dep": "👑आरंभ करने से पहले आपको अपने खाते का बैलेंस भरना होगा। मैं कम से कम 2000 रूबल भरने की सलाह देता हूँ।"
    },
    "id": {
        "welcome": "Selamat datang! Silakan pilih bahasa Anda:",
        "subscribe": "Untuk menggunakan bot, silakan berlangganan channel kami:",
        "check": "✅ Periksa langganan",
        "subscribe_btn": "📢 Berlangganan channel",
        "access_granted": "🎉 Akses diberikan! Memuat menu...",
        "not_subscribed": "❌ Anda belum berlangganan! Klik 'Berlangganan' dan coba lagi.",
        "check_error": "⚠️ Kesalahan pemeriksaan langganan. Silakan coba lagi nanti.",
        "menu": "Menu Utama",
        "reg": "📝 Pendaftaran",
        "instr": "📚 Petunjuk",
        "support": "🛠 Dukungan",
        "algo": "⚙️ Algoritma",
        "next": "➡️ Lanjut",
        "back": "⬅️ Kembali",
        "registration_message": "👑 Halo! Untuk mengaktifkan bot, lakukan pendaftaran cepat di situs web 1WIN (<a href=\"PERSONAL_LINK\">KLIK</a>)\n\n⚠️ Penting untuk membuat akun BARU menggunakan tautan dalam pesan ini! Gunakan nomor telepon yang belum pernah digunakan di situs ini sebelumnya, dan jangan gunakan akun media sosial. Jika Anda sudah memiliki akun di 1WIN, silakan keluar.\n\n1. Klik tombol: <a href=\"PERSONAL_LINK\">Daftar</a> dalam mode penyamaran, buka situs web 1WIN dan BUAT AKUN BARU. Jika situs tidak terbuka, coba gunakan VPN: Vpnify, Planet VPN, Hotspot VPN, dll.",
        "dep": "👑Sebelum memulai, Anda perlu mengisi saldo akun Anda. Saya menyarankan untuk mengisi minimal 2.000 rubel."
    },
    "pt": {
        "welcome": "Bem-vindo! Por favor selecione seu idioma:",
        "subscribe": "Para usar o bot, por favor assine nosso canal:",
        "check": "✅ Verificar assinatura",
        "subscribe_btn": "📢 Assinar canal",
        "access_granted": "🎉 Acesso concedido! Carregando menu...",
        "not_subscribed": "❌ Você não está inscrito! Clique em 'Assinar' e tente novamente.",
        "check_error": "⚠️ Erro na verificação de assinatura. Por favor tente mais tarde.",
        "menu": "Menu Principal",
        "reg": "📝 Registro",
        "instr": "📚 Instruções",
        "support": "🛠 Suporte",
        "algo": "⚙️ Algoritmo",
        "next": "➡️ Próximo",
        "back": "⬅️ Voltar",
        "registration_message": "👑 Olá! Para ativar o bot, faça um registro rápido no site 1WIN (<a href=\"PERSONAL_LINK\">CLIQUE</a>)\n\n⚠️ É importante criar uma NOVA conta usando o link nesta mensagem! Use um número de telefone que não tenha sido usado neste site antes e não use contas de redes sociais. Se você já tem uma conta no 1WIN, por favor, faça logout.\n\n1. Clique no botão: <a href=\"PERSONAL_LINK\">Registrar</a> no modo anônimo, acesse o site 1WIN e CRIE UMA NOVA CONTA. Se o site não abrir, tente usar uma VPN: Vpnify, Planet VPN, Hotspot VPN, etc.",
        "dep": "👑Antes de começar, você precisa recarregar o saldo da sua conta. Recomendo recarregar com pelo menos 2.000 rublos."
    },
    "vi": {
        "welcome": "Chào mừng! Vui lòng chọn ngôn ngữ của bạn:",
        "subscribe": "Để sử dụng bot, vui lòng đăng ký kênh của chúng tôi:",
        "check": "✅ Kiểm tra đăng ký",
        "subscribe_btn": "📢 Đăng ký kênh",
        "access_granted": "🎉 Đã cấp quyền truy cập! Đang tải menu...",
        "not_subscribed": "❌ Bạn chưa đăng ký! Nhấn 'Đăng ký' và thử lại.",
        "check_error": "⚠️ Lỗi kiểm tra đăng ký. Vui lòng thử lại sau.",
        "menu": "Menu Chính",
        "reg": "📝 Đăng ký",
        "instr": "📚 Hướng dẫn",
        "support": "🛠 Hỗ trợ",
        "algo": "⚙️ Thuật toán",
        "next": "➡️ Tiếp",
        "back": "⬅️ Quay lại",
        "registration_message": "👑 Xin chào! Để kích hoạt bot, hãy hoàn tất đăng ký nhanh trên trang web 1WIN (<a href=\"PERSONAL_LINK\">NHẤN</a>)\n\n⚠️ Điều quan trọng là phải tạo tài khoản MỚI bằng liên kết trong tin nhắn này! Sử dụng số điện thoại chưa từng được sử dụng trên trang web này trước đây và không sử dụng tài khoản mạng xã hội. Nếu bạn đã có tài khoản trên 1WIN, vui lòng đăng xuất.\n\n1. Nhấn vào nút: <a href=\"PERSONAL_LINK\">Đăng ký</a> ở chế độ ẩn danh, truy cập trang web 1WIN và TẠO TÀI KHOẢN MỚI. Nếu trang web không mở, hãy thử sử dụng VPN: Vpnify, Planet VPN, Hotspot VPN, v.v.",
        "dep": "👑Trước khi bắt đầu, bạn cần nạp tiền vào tài khoản. Tôi khuyên bạn nên nạp ít nhất 2.000 rúp."
    },
    "uk": {
        "welcome": "Ласкаво просимо! Будь ласка, оберіть мову:",
        "subscribe": "Для використання бота, будь ласка, підпишіться на наш канал:",
        "check": "✅ Перевірити підписку",
        "subscribe_btn": "📢 Підписатися на канал",
        "access_granted": "🎉 Доступ надано! Завантаження меню...",
        "not_subscribed": "❌ Ви не підписані! Натисніть 'Підписатися' і спробуйте знову.",
        "check_error": "⚠️ Помилка перевірки підписки. Будь ласка, спробуйте пізніше.",
        "menu": "Головне меню",
        "reg": "📝 Реєстрація",
        "instr": "📚 Інструкція",
        "support": "🛠 Підтримка",
        "algo": "⚙️ Алгоритм",
        "next": "➡️ Далі",
        "back": "⬅️ Назад",
        "registration_message": "👑 Привіт! Для активації бота пройди швидку реєстрацію на сайті 1WIN (<a href=\"PERSONAL_LINK\">КЛІК</a>)\n\n⚠️ Важливо створити НОВИЙ акаунт за посиланням у цьому повідомленні! Використовуй номер телефону, який раніше не використовувався на цьому сайті, і не використовуй соціальні мережі. Якщо у тебе вже є акаунт на 1WIN, вийди з нього.\n\n1. Натисни на кнопку: <a href=\"PERSONAL_LINK\">Зареєструватися</a> у режимі інкогніто, перейди на сайт 1WIN і СТВОРИ НОВИЙ АКАУНТ. Якщо сайт не відкривається, спробуй використовувати VPN: Vpnify, Planet VPN, Hotspot VPN тощо.",
        "dep": "👑Перед стартом необхідно поповнити баланс свого акаунта. Рекомендую поповнювати від 2000 рублів."
    },
    "fr": {
        "welcome": "Bienvenue! Veuillez sélectionner votre langue:",
        "subscribe": "Pour utiliser le bot, veuillez vous abonner à notre chaîne:",
        "check": "✅ Vérifier l'abonnement",
        "subscribe_btn": "📢 S'abonner à la chaîne",
        "access_granted": "🎉 Accès accordé! Chargement du menu...",
        "not_subscribed": "❌ Vous n'êtes pas abonné! Cliquez sur 'S'abonner' et réessayez.",
        "check_error": "⚠️ Erreur de vérification d'abonnement. Veuillez réessayer plus tard.",
        "menu": "Menu Principal",
        "reg": "📝 Inscription",
        "instr": "📚 Instructions",
        "support": "🛠 Support",
        "algo": "⚙️ Algorithme",
        "next": "➡️ Suivant",
        "back": "⬅️ Retour",
        "registration_message": "👑 Bonjour ! Pour activer le bot, effectuez une inscription rapide sur le site 1WIN (<a href=\"PERSONAL_LINK\">CLIQUEZ</a>)\n\n⚠️ Il est important de créer un NOUVEAU compte en utilisant le lien dans ce message ! Utilisez un numéro de téléphone qui n’a jamais été utilisé sur ce site auparavant et n’utilisez pas de comptes de réseaux sociaux. Si vous avez déjà un compte sur 1WIN, veuillez vous déconnecter.\n\n1. Cliquez sur le bouton : <a href=\"PERSONAL_LINK\">S’inscrire</a> en mode incognito, accédez au site 1WIN et CRÉEZ UN NOUVEAU COMPTE. Si le site ne s’ouvre pas, essayez d’utiliser un VPN : Vpnify, Planet VPN, Hotspot VPN, etc.",
        "dep": "👑Avant de commencer, vous devez recharger le solde de votre compte. Je recommande de recharger avec au moins 2000 roubles."
    }
}